#ifndef _BT_H
#define _BT_H

/** ****************************************************************************
 * @file BT.h
 * @brief Открытый интерфейс для создания структуры бинарного дерева поиска.
 * @author Петров А.С.
 * ****************************************************************************/


/* --- Подключение заголовочных файлов -------------------------------------- */

// Файлы проекта
#include "BT_types.h" // Общие типы данных проекта



/* --- Пользовательский интерфейс ------------------------------------------- */

btsIBinaryTree* btNewBinaryTree( void );

/// @todo
void btDeleteBinaryTree( btsIBinaryTree * restrict deleting );


#endif // _BT_H
